БухЭксп/InformationRegisters/CW_ТекущийЭтапСогласованияОбъекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ТекущийЭтапСогласованияОбъекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтапСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ЭтапыСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСогласования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыСогласования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ЛицаЗамещающиеИнициаторовСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЛицаЗамещающиеИнициаторовСогласования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИнициаторСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицоЗамещающееИнициатораСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_НазначениеМаршрутовСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_НазначениеМаршрутовСогласования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>МаршрутСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыСогласования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прервано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокСогласованияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокСогласованияОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Параллельное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Последовательное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_СобытияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СобытияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ЭтапыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ЭтапыСогласования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектСогласования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыСогласования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокСогласованияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеЗавершение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МаршрутСогласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаСогласования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыСогласования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_СобытияСогласования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Замечания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокСогласования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получено</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продолжительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидаетСогласования</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_МаршрутыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_МаршрутыСогласования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокСогласованияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСогласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаСогласования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыСогласования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокСогласования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ГруппыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ГруппыСогласования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonForms/CW_ФормаСогласования/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ОбъектСогласования") Тогда
		Отказ = истина;
	КонецЕсли;
	
	ОбъектСогласования = Параметры.ОбъектСогласования;
	
	Если Не ЗначениеЗаполнено(ОбъектСогласования) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;  
	
	ЭтапСогласования = РегистрыСведений.CW_ТекущийЭтапСогласованияОбъекта.ПолучитьТекущийЭтапСогласованияОбъекта(ОбъектСогласования);
	Если ЗначениеЗаполнено(ЭтапСогласования) Тогда
		ОбновитьЭтапыСогласования();
	КонецЕсли;     
	
	УстановитьВозможностьИнициацииСогласования();
	
	УстановитьПометкуКнопокЭтапаСогласования(ЭтапСогласования);

КонецПроцедуры  


&НаСервере
Процедура УстановитьВозможностьИнициацииСогласования()

	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ОбъектСогласования));  
	
	ПараметрыОпции = новый Структура;
	ПараметрыОпции.Вставить("CW_ГруппаПользователя", ГруппаПользователя);
	ПараметрыОпции.Вставить("CW_ОбъектСогласования", ИдентификаторОбъекта);
	
	РазрешеноИнициироватьСогласование   = ПолучитьФункциональнуюОпцию("CW_ДоступнаИнициацияСогласования", ПараметрыОпции);
	ТекущийПользовательЗамещает 		= РегистрыСведений.CW_ЛицаЗамещающиеИнициаторовСогласования.РазрешеноИнициироватьСогласование(ИдентификаторОбъекта);    
	ТекущийПользовательИнициатор 		= ЭтапСогласования.Инициатор = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭтапыСогласования()
	
	ИндексыКартинокЭтапа = ПолучитьСоответствиеИндексаКартинкиЭтаповСогласования();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЭтапыСогласования.Ссылка КАК ЭтапСогласования,
	               |	CW_ЭтапыСогласования.Наименование КАК Наименование,
	               |	CW_ЭтапыСогласования.Инициатор КАК Инициатор,
	               |	CW_ЭтапыСогласования.ДатаНачала КАК ДатаНачала,
	               |	CW_ЭтапыСогласования.ПлановаяДатаЗавершения КАК ПлановаяДатаЗавершения,
	               |	CW_ЭтапыСогласования.ДатаЗавершения КАК ДатаЗавершения,
	               |	CW_ЭтапыСогласования.СостояниеСогласования КАК СостояниеСогласования,
	               |	CW_ЭтапыСогласования.ПорядокСогласования КАК ПорядокСогласования,
	               |	CW_ЭтапыСогласования.Код КАК Код,
	               |	CW_ЭтапыСогласования.Завершен КАК Завершен,
	               |	CW_ЭтапыСогласования.Комментарий КАК Комментарий,
	               |	CW_ЭтапыСогласования.АвтоматическоеЗавершение КАК АвтоматическоеЗавершение
	               |ИЗ
	               |	Справочник.CW_ЭтапыСогласования КАК CW_ЭтапыСогласования
	               |ГДЕ
	               |	CW_ЭтапыСогласования.ОбъектСогласования = &ОбъектСогласования
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Код УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ОбъектСогласования",ОбъектСогласования);
	Запрос.Выполнить();
	
	РезультатЭтапыСогласования = Запрос.Выполнить();
	ЭтапыСогласования.Загрузить(РезультатЭтапыСогласования.Выгрузить());
	
	Для Каждого СтрокаЭтапа из ЭтапыСогласования Цикл
		СтрокаЭтапа.ИндексКартинки = ИндексыКартинокЭтапа.Получить(СтрокаЭтапа.СостояниеСогласования);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьМаршрутыЭтапаСогласования(ВыбранныйЭтапСогласования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЭтапыСогласованияМаршрутСогласования.Ссылка КАК ЭтапСогласования,
	               |	CW_ЭтапыСогласованияМаршрутСогласования.НомерСтроки КАК НомерСтроки,
	               |	CW_ЭтапыСогласованияМаршрутСогласования.ГруппаСогласования КАК ГруппаСогласования,
	               |	CW_ЭтапыСогласованияМаршрутСогласования.Пользователь КАК Пользователь,
	               |	CW_ЭтапыСогласованияМаршрутСогласования.Событие КАК Событие,
	               |	CW_ЭтапыСогласованияМаршрутСогласования.ДатаСобытия КАК ДатаСобытия,
	               |	CW_ЭтапыСогласованияМаршрутСогласования.Замечания КАК Замечания,
	               |	CW_ЭтапыСогласованияМаршрутСогласования.СрокСогласования КАК СрокСогласования,
	               |	CW_ЭтапыСогласованияМаршрутСогласования.ПлановаяДата КАК ПлановаяДата,
	               |	CW_ЭтапыСогласованияМаршрутСогласования.ОжидаетСогласования КАК ОжидаетСогласования
	               |ИЗ
	               |	Справочник.CW_ЭтапыСогласования.МаршрутСогласования КАК CW_ЭтапыСогласованияМаршрутСогласования
	               |ГДЕ
	               |	CW_ЭтапыСогласованияМаршрутСогласования.Ссылка = &ВыбранныйЭтапСогласования
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтапСогласования,
	               |	НомерСтроки
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ВыбранныйЭтапСогласования",ВыбранныйЭтапСогласования);
	
	РезультатМаршрутСогласования = Запрос.Выполнить(); 
	
	Возврат РезультатМаршрутСогласования.Выгрузить();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьМаршрутыЭтапаСогласования(ЭтапТекущиейСтроки)
	
	Если ЭтапТекущиейСтроки <> Неопределено Тогда
		
		ИндексыКартинкиСтрок = ПолучитьСоответствиеИндексаКартинкиСтрок();
		МаршрутыСогласования = ПолучитьМаршрутыЭтапаСогласования(ЭтапТекущиейСтроки);
		МаршрутСогласования.Загрузить(МаршрутыСогласования);
		
		Для Каждого СтрокаМаршрута из МаршрутСогласования Цикл
			СтрокаМаршрута.ИндексКартинки 		= ИндексыКартинкиСтрок.Получить(СтрокаМаршрута.Событие);
		КонецЦикла;
		
		УстановитьПометкуКнопокЭтапаСогласования(ЭтапТекущиейСтроки);
		
	КонецЕсли;
	
	УстановитьДоступностьКнопокМаршрута(ЭтапТекущиейСтроки);
	УстановитьДоступностьКнопокСогласования();

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКнопокМаршрута(Знач ЭтапТекущиейСтроки = Неопределено)
	
	ДоступностьОсновныхКнопок 	 = Ложь;
	ДоступностьКнопокДобавления  = Ложь;
	ДоступностьКнопкиКомментарий = Ложь;
	
	Если ЭтапТекущиейСтроки <> Неопределено Тогда
		
		ДоступностьОсновныхКнопок 		= ЭтапСогласования.СостояниеСогласования = ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.НаСогласовании")
											И ЭтапТекущиейСтроки = ЭтапСогласования;
		
		ДоступностьКнопокДобавления 	= ЭтапСогласования.СостояниеСогласования = ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Черновик")
											И ЭтапТекущиейСтроки = ЭтапСогласования;
			
		ДоступностьКнопкиКомментарий 	= ЭтапСогласования.СостояниеСогласования <> ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Черновик")
											И ЭтапТекущиейСтроки = ЭтапСогласования;
	
	КонецЕсли;
	
	Элементы.СогласованиеСоглсовано.Доступность				= ДоступностьОсновныхКнопок;
	Элементы.СогласованиеОтклонить.Доступность				= ДоступностьОсновныхКнопок;
	
	Элементы.ЗаполнитьПоШаблону.Доступность 				= ДоступностьКнопокДобавления;
	Элементы.МаршрутСогласованияПеремещение.Доступность		= ДоступностьКнопокДобавления;
	Элементы.МаршрутСогласованияОсновныеКнопки.Доступность	= ДоступностьКнопокДобавления;
	
	Элементы.ОтпрвитьПисьмо.Доступность						= ЭтапТекущиейСтроки <> Неопределено;
	Элементы.СогласованиеКомментарий.Доступность			= ДоступностьКнопкиКомментарий;
	
	//Контекстное меню
	
	Элементы.МаршрутСогласованияКонтекстноеМенюОтпрвитьПисьмо.Доступность 	= ЭтапТекущиейСтроки <> Неопределено;
	
	Элементы.КонтекстноеМенюПеремещение.Доступность 					  	= ДоступностьКнопокДобавления;

	Элементы.МаршрутСогласованияКонтекстноеМенюСогласованиеСоглсовано.Доступность  	= ДоступностьОсновныхКнопок;
	Элементы.МаршрутСогласованияКонтекстноеМенюСогласованиеОтклонить.Доступность    = ДоступностьОсновныхКнопок;
	
	Элементы.МаршрутСогласованияКонтекстноеМенюСогласованиеКомментарий.Доступность = ДоступностьКнопкиКомментарий;

КонецПроцедуры

&НаКлиенте
Процедура ЭтапыСогласованияПриАктивизацииСтроки(Элемент)
	
	ЭтапТекущиейСтроки 	= Неопределено;
	ТекущиеДанные 		= Элементы.ЭтапыСогласования.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ЭтапТекущиейСтроки = ТекущиеДанные.ЭтапСогласования;
	КонецЕсли;
	
	ЗаполнитьМаршрутыЭтапаСогласования(ЭтапТекущиейСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыСогласованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина; 
	
	ДобавитьКопироватьДоступно  = ПолучитьДоступностьКнопокДобавитьКопировать(); 
	Если Не (ДобавитьКопироватьДоступно и РазрешеноИнициироватьСогласование) Тогда
		Возврат;
	КонецЕсли;
	
	Если Копирование Тогда
		ТекущаяСтрока = Элементы.ЭтапыСогласования.ТекущаяСтрока;
		СкопироватьСтрокуЭтапаСогласования(ТекущаяСтрока); 
		Оповестить("Изменение_СогласованиеОбъектов");
	Иначе
		ОписаниеОпвещения = Новый ОписаниеОповещения("ЗавершитьВыборЗамещаемого", ЭтотОбъект);  
		
		СписокЗамещаемых  = ПолучитьСписокЗамещаемых(ИдентификаторОбъекта);
		
		Если СписокЗамещаемых.Количество() > 0 Тогда
			СписокЗамещаемых.ПоказатьВыборЭлемента(ОписаниеОпвещения, "Выберите инициатора");
		Иначе                                            
			ТекущийПользователь = ПолучитьТекущегоПользователя(); 
			СписокЗначений = Новый СписокЗначений;
			СписокЗначений.Добавить(ТекущийПользователь);
			ВыполнитьОбработкуОповещения(ОписаниеОпвещения, СписокЗначений[0]);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокЗамещаемых(ИдентификаторОбъекта)
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Возврат РегистрыСведений.CW_ЛицаЗамещающиеИнициаторовСогласования.ПолучитьСписокЗамещаемых(ТекущийПользователь, ИдентификаторОбъекта);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьВыборЗамещаемого(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	СоздатьСтрокуЭтапаСогласования(РезультатВыбора.Значение);
	
	ТекущиеДанные 		= ЭтапыСогласования[0];
	ЭтапСогласования 	= ТекущиеДанные.ЭтапСогласования;
	
	УстановитьВозможностьИнициацииСогласования();

	ИзменитьНаименованиеНаКлиенте(ТекущиеДанные);
	
	УстановитьПометкуКнопокЭтапаСогласования(ЭтапСогласования);

	Оповестить("Изменение_СогласованиеОбъектов");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСтрокуЭтапаСогласования(Инициатор)
	
	НомерЭтапа = Строка(ЭтапыСогласования.Количество() + 1);
	ЭтапСогласования = Справочники.CW_ЭтапыСогласования.ДобавитьНовыйЭтапСогласования(ОбъектСогласования, НомерЭтапа, Инициатор);	
	
	РегистрыСведений.CW_ТекущийЭтапСогласованияОбъекта.ЗаписатьТекущийЭтапСогласованияОбъекта(ОбъектСогласования, ЭтапСогласования);
	
	ОбновитьЭтапыСогласования();
	УстановитьДоступностьКнопокСогласования();

КонецПроцедуры

&НаСервере
Процедура СкопироватьСтрокуЭтапаСогласования(ИдентифкаторСтроки)
	
	ТекущаяСтрока 	= ЭтапыСогласования.НайтиПоИдентификатору(ИдентифкаторСтроки);
	
	ВыбранныйЭтапСогласования = ТекущаяСтрока.ЭтапСогласования;
	
	КопияЭтапСогласования = ВыбранныйЭтапСогласования.Скопировать(); 
	КопияЭтапСогласования.Записать();
	
	ЭтапСогласования = КопияЭтапСогласования.Ссылка;
	РегистрыСведений.CW_ТекущийЭтапСогласованияОбъекта.ЗаписатьТекущийЭтапСогласованияОбъекта(ОбъектСогласования, ЭтапСогласования);

	ОбновитьЭтапыСогласования();
	УстановитьДоступностьКнопокСогласования();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеМаршрутаСогласования(ПараметрыЗаписиМаршрута)

	ОбъектЭтап  = ЭтапСогласования.ПолучитьОбъект();
	
	Если ПараметрыЗаписиМаршрута.ЗаписатьРеквизиты Тогда
		СтрокаТекущегоЭтапа = ПолучитьСтрокуТекущегоЭтапаСогласования();
		Если СтрокаТекущегоЭтапа = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОбъектЭтап, СтрокаТекущегоЭтапа);
		
	КонецЕсли;
	
	Если ПараметрыЗаписиМаршрута.ЗаписатьМаршрут Тогда 
		ОбъектЭтап.МаршрутСогласования.Загрузить(МаршрутСогласования.Выгрузить());
	КонецЕсли;    
	
	СостояниеОбъекта = ОбъектЭтап.СостояниеСогласования;
	Если ПараметрыЗаписиМаршрута.СостояниеОбъекта <> Неопределено Тогда
		СостояниеОбъекта = ПараметрыЗаписиМаршрута.СостояниеОбъекта;
	КонецЕсли;
	
	ОбъектЭтап.ДополнительныеСвойства.Вставить("ЗаписатьОбъектНаСогласование", 	ПараметрыЗаписиМаршрута.ЗаписатьОбъектНаСогласование);
	ОбъектЭтап.ДополнительныеСвойства.Вставить("ЗаписатьСостояниеОбъекта", 		ПараметрыЗаписиМаршрута.ЗаписатьСостояниеОбъекта);
	ОбъектЭтап.ДополнительныеСвойства.Вставить("ОповеститьПользователей", 		ПараметрыЗаписиМаршрута.ОповеститьПользователей);
	ОбъектЭтап.ДополнительныеСвойства.Вставить("ОповеститьИнициатора", 			ПараметрыЗаписиМаршрута.ОповеститьИнициатора);
	ОбъектЭтап.ДополнительныеСвойства.Вставить("ОтменитьОбъектНаСогласование", 	ПараметрыЗаписиМаршрута.ОтменитьОбъектНаСогласование);
	ОбъектЭтап.ДополнительныеСвойства.Вставить("СостояниеОбъекта", 				СостояниеОбъекта);
	
	ОбъектЭтап.Записать();
	
	ЭтапСогласования = ОбъектЭтап.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутСогласованияПриИзменении(Элемент)
	
	ПараметрыЗаписиМаршрута = CW_СогласованиеКлиентСервер.ПолучитьСтруктуруПараметровЗаписиМаршрута();
	ПараметрыЗаписиМаршрута.ЗаписатьМаршрут = Истина;
	
	ЗаписатьДанныеМаршрутаСогласования(ПараметрыЗаписиМаршрута);

	Оповестить("Изменение_СогласованиеОбъектов");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьЗаполнениеПоШаблону", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Маршрут будет заполнен по шаблону. Продолжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнениеПоШаблону(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ссылка", ПолучитьМассивМаршрутовНаСервере());
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отбор", СтруктураОтбора);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьЗаполнениеМаршрутовСОгласования", ЭтотОбъект);
	ОткрытьФорму("Справочник.CW_МаршрутыСогласования.ФормаВыбора",ПараметрыОтбора, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Функция  ПолучитьМассивМаршрутовНаСервере()

	Возврат РегистрыСведений.CW_НазначениеМаршрутовСогласования.ПолучитьМаршрутыДоступныеОбъектуСогласования(ОбъектСогласования);

КонецФункции

&НаКлиенте
Процедура ПродолжитьЗаполнениеМаршрутовСОгласования(ВыбранноеЗначение, Параметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьМаршрутыНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМаршрутыНаСервере(ВыбранноеЗначение)
	
	МаршрутСогласования.Очистить();
	Для Каждого СтрокаШаблона из ВыбранноеЗначение.СписокСогласования Цикл
		НоваяСтрока = МаршрутСогласования.Добавить();
		НоваяСтрока.ГруппаСогласования 	= СтрокаШаблона.ГруппаСогласования;
		НоваяСтрока.СрокСогласования 	= СтрокаШаблона.СрокСогласования;
		НоваяСтрока.Пользователь 		= СтрокаШаблона.ГруппаСогласования.СписокСотрудников[0].Пользователь;
	КонецЦикла;
	
	ПараметрыЗаписиМаршрута = CW_СогласованиеКлиентСервер.ПолучитьСтруктуруПараметровЗаписиМаршрута();
	ПараметрыЗаписиМаршрута.ЗаписатьМаршрут = Истина;  
	ЗаписатьДанныеМаршрутаСогласования(ПараметрыЗаписиМаршрута);
	УстановитьПорядокСогласованияНаСервере(ВыбранноеЗначение.ПорядокСогласования);
	
	УстановитьДоступностьКнопокСогласования();

КонецПроцедуры


&НаСервере
Функция ПолучитьДоступностьКнопокПорядокСогласования()
	
	Если ЭтапСогласования.Завершен 
		ИЛИ ЭтапСогласования.СостояниеСогласования <> ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Черновик") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьДоступностьКнопкиНачатьСогласование()
	
	Если ЭтапСогласования.Завершен 
		ИЛИ ЭтапСогласования.СостояниеСогласования <> ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Черновик")
		ИЛИ ЭтапСогласования.МаршрутСогласования.Количество() = 0 Тогда
		Возврат ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьДоступностьКнопокДобавитьКопировать()
	
	Если ЭтапыСогласования.Количество() = 0 ИЛИ ЭтапСогласования.Завершен Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
												
&НаСервере
Функция ПолучитьДоступностьКнопкиЗавершить()
	
	Если ЭтапСогласования.Завершен или МаршрутСогласования.Количество() = 0 Тогда
		Возврат ложь;
	КонецЕсли;
	
	Если ЭтапСогласования.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Последовательное") Тогда
		
		мСтроки = МаршрутСогласования.НайтиСтроки(Новый Структура("Событие", ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.ПустаяСсылка")));
		Возврат мСтроки.Количество() = 0;
		
	КонецЕсли;

	Если ЭтапСогласования.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Параллельное") Тогда
		
		мСтроки = МаршрутСогласования.НайтиСтроки(Новый Структура("Событие", ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.Отклонено")));
		Если мСтроки.Количество() > 0 Тогда
			Возврат Истина;
		КонецЕсли;
		
		мСтроки = МаршрутСогласования.НайтиСтроки(Новый Структура("Событие", ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.ПустаяСсылка")));
		Если мСтроки.Количество() = 0 Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции



&НаКлиенте
Процедура КомандаПараллельное(Команда)
	
	УстановитьПорядокСогласованияНаСервере(ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Параллельное"));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоследовательное(Команда)
	
	УстановитьПорядокСогласованияНаСервере(ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Последовательное"));
	
КонецПроцедуры


&НаСервере
Процедура УстановитьПорядокСогласованияНаСервере(ПорядокСогласования)
	
	СтрокаТекущегоЭтапа = ПолучитьСтрокуТекущегоЭтапаСогласования();
	Если СтрокаТекущегоЭтапа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Запишем в строку
	СтрокаТекущегоЭтапа.ПорядокСогласования = ПорядокСогласования;
	
	ПараметрыЗаписиМаршрута = CW_СогласованиеКлиентСервер.ПолучитьСтруктуруПараметровЗаписиМаршрута();
	ПараметрыЗаписиМаршрута.ЗаписатьРеквизиты = Истина;

	ЗаписатьДанныеМаршрутаСогласования(ПараметрыЗаписиМаршрута);
	
	УстановитьПометкуКнопокЭтапаСогласования(ЭтапСогласования);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНаименование(Команда) 
	
	ТекущиеДанные = Элементы.ЭтапыСогласования.ТекущиеДанные;
	ИзменитьНаименованиеНаКлиенте(ТекущиеДанные);
	
КонецПроцедуры   

&НаКлиенте
Процедура ИзменитьНаименованиеНаКлиенте(ТекущиеДанные)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаНаименования",ЭтотОбъект);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Наименование", 	ТекущиеДанные.Наименование);
	СтруктураПараметров.Вставить("Комментарий",  	ТекущиеДанные.Комментарий);
	СтруктураПараметров.Вставить("ТолькоПросмотр",  НЕ ТекущийПользовательИнициатор);
	
	ОткрытьФорму("Справочник.CW_ЭтапыСогласования.Форма.ФормаВводаНаименованияИКомментария",СтруктураПараметров, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНаименования(Ответ, Параметры) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ЭтапыСогласования.ТекущаяСтрока;
	УстановитьНаименованиеНаСервере(ТекущаяСтрока, Ответ);

КонецПроцедуры

&НаСервере
Процедура УстановитьНаименованиеНаСервере(ИдентифкаторСтроки, Ответ)
	
	//Запишем в строку
	ТекущаяСтрока = ЭтапыСогласования.НайтиПоИдентификатору(ИдентифкаторСтроки);
	
	Если ЗначениеЗаполнено(Ответ.Наименование) Тогда
		ТекущаяСтрока.Наименование 	= Ответ.Наименование;
	Иначе
		ТекущаяСтрока.Наименование 	= Ответ.НаименованиеСтарое;
	КонецЕсли;
	
	ТекущаяСтрока.Комментарий 	= Ответ.Комментарий;
	
	ПараметрыЗаписиМаршрута = CW_СогласованиеКлиентСервер.ПолучитьСтруктуруПараметровЗаписиМаршрута();
	ПараметрыЗаписиМаршрута.ЗаписатьРеквизиты = Истина;
	
	ЗаписатьДанныеМаршрутаСогласования(ПараметрыЗаписиМаршрута);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуКнопокЭтапаСогласования(ЭтапТекущиейСтроки)
	
	ЦветАктивности 	= Новый Цвет(0,150,70);
	ЦветТекстаФормы = Новый Цвет;
	
	Элементы.КомандаПараллельное.Пометка 	 = ЭтапТекущиейСтроки.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Параллельное");
	Элементы.КомандаПоследовательное.Пометка = ЭтапТекущиейСтроки.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Последовательное");
		
	Элементы.КомандаПараллельное.ЦветТекста 	= ?(ЭтапТекущиейСтроки.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Параллельное"),ЦветАктивности, ЦветТекстаФормы);
	Элементы.КомандаПоследовательное.ЦветТекста = ?(ЭтапТекущиейСтроки.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Последовательное"),ЦветАктивности, ЦветТекстаФормы);
	
	Элементы.КомандаЗавершатьАвтоматически.Пометка 	 = ЭтапТекущиейСтроки.АвтоматическоеЗавершение;  
	Элементы.КомандаЗавершатьАвтоматически.Пометка 	 = ЭтапТекущиейСтроки.АвтоматическоеЗавершение;  
	Элементы.КомандаЗавершатьАвтоматически.Картинка  = ?(ЭтапТекущиейСтроки.АвтоматическоеЗавершение, БиблиотекаКартинок.CW_ЗеленаяТочка, БиблиотекаКартинок.CW_СераяТочка);  
	
КонецПроцедуры   

&НаСервере
Процедура УстановитьДоступностьКнопокСогласования()  
	
	ДоступностьКнопокДобавитьКопировать  = ПолучитьДоступностьКнопокДобавитьКопировать(); 
	ДоступностьКнопокПорядокСогласования = ПолучитьДоступностьКнопокПорядокСогласования();   
	ДоступностьКнопкиНачатьСогласование	 = ПолучитьДоступностьКнопкиНачатьСогласование();
	
	Элементы.ЭтапыСогласованияДобавить.Доступность  	= РазрешеноИнициироватьСогласование И ДоступностьКнопокДобавитьКопировать;
	Элементы.ЭтапыСогласованияСкопировать.Доступность  	= РазрешеноИнициироватьСогласование И ДоступностьКнопокДобавитьКопировать;
	
	Элементы.СогласованиеНачать.Доступность			= РазрешеноИнициироватьСогласование И ДоступностьКнопкиНачатьСогласование;
														
	Элементы.МаршрутСогласования.ТолькоПросмотр 	= ЭтапСогласования.СостояниеСогласования <> ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Черновик"); 
	
	Элементы.ИзменитьНаименование.Доступность	= (ТекущийПользовательИнициатор ИЛИ ТекущийПользовательЗамещает);
														
	Элементы.ПорядокСогласования.Доступность			= (ТекущийПользовательИнициатор ИЛИ ТекущийПользовательЗамещает) И ДоступностьКнопокПорядокСогласования;
	Элементы.КомандаЗавершатьАвтоматически.Доступность	= (ТекущийПользовательИнициатор ИЛИ ТекущийПользовательЗамещает) И ДоступностьКнопокПорядокСогласования;
															
	Элементы.СогласованиеОтмена.Доступность		= (ТекущийПользовательИнициатор ИЛИ ТекущийПользовательЗамещает) И Не ЭтапСогласования.Завершен;
	Элементы.СогласованиеЗавершить.Доступность 	= (ТекущийПользовательИнициатор ИЛИ ТекущийПользовательЗамещает) 
													И РазрешеноИнициироватьСогласование 
													И ПолучитьДоступностьКнопкиЗавершить() 
													И НЕ ЭтапСогласования.АвтоматическоеЗавершение;  
													
КонецПроцедуры


&НаКлиенте
Процедура ОтпрвитьПисьмо(Команда)
	
	ВыделенныеСтроки = Элементы.МаршрутСогласования.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки = Неопределено Тогда
		ПоказатьПредупреждение(,"Выберите строку согласования для отправки создаия письма");
		Возврат;
	КонецЕсли;
	
	мПолучатели 	= ПолучитьМассивПолучателейПисьма(ВыделенныеСтроки);
	ПараметрыПисьма = CW_Согласование.ПолучитьДанныеПисьмаСогласования(ЭтапСогласования, "Добрый день.");
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		
		УчетнаяЗапись = CW_РаботаСЭлектроннойПочтой.ПолучитьУчетнуюЗаписьДляОтправкиПисемНаСогласование();
		
		ПараметрыОтправки = Новый Структура;
		ПараметрыОтправки.Вставить("Отправитель", 	УчетнаяЗапись);
		ПараметрыОтправки.Вставить("Получатель", 	мПолучатели.Получатели);
		ПараметрыОтправки.Вставить("Тема",			ПараметрыПисьма.Тема);
		ПараметрыОтправки.Вставить("Текст", 		ПараметрыПисьма.Текст.ПолучитьТекст());
		
		МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
	Иначе
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("mailto:"+мПолучатели.Адреса);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивПолучателейПисьма(ВыделенныеСтроки)
	
	Получатель 	= Новый Массив;
	Адреса 		= Новый Массив;
	
	Для Каждого ИдентификаторСтроки из  ВыделенныеСтроки Цикл
		
		ТекущаяСтрока = МаршрутСогласования.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		ИсточникКонтактнойИнформации 	= ТекущаяСтрока.Пользователь;
		ФизическоеЛицо 					= ТекущаяСтрока.Пользователь.ФизическоеЛицо;
		АдресПочты 						= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ИсточникКонтактнойИнформации,
											ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailПользователя"),
											, Истина);
		
		Если Адреса.Найти(АдресПочты)  = Неопределено Тогда
			
			Получатель.Добавить(Новый Структура("Адрес, Представление, ИсточникКонтактнойИнформации, ФизическоеЛицо", 
			АдресПочты, СтрЗаменить(Строка(ИсточникКонтактнойИнформации), ",", ""), ИсточникКонтактнойИнформации, ФизическоеЛицо));
			
			Адреса.Добавить(АдресПочты);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Структура("Получатели, Адреса", Получатель, Адреса)
	
КонецФункции



&НаКлиенте
Процедура СогласованиеНачать(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаНачатьПроцедуруСогласования", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Начать процедуру согласования?", Режим, 0);

КонецПроцедуры   

&НаКлиенте
Процедура ПослеЗакрытияВопросаНачатьПроцедуруСогласования(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	Отказ = Ложь;
	ПроверитьЗаполениеТаблицыСогласования(Отказ);
	
	Если Не Отказ Тогда
		СогласованиеНачатьНаСервере();
		УстановитьДоступностьКнопокСогласования();
	КонецЕсли;

	Оповестить("Изменение_СогласованиеОбъектов");
	

КонецПроцедуры

&НаСервере
Процедура СогласованиеНачатьНаСервере()
	
	СтрокаТекущегоЭтапа = ПолучитьСтрокуТекущегоЭтапаСогласования();
	Если СтрокаТекущегоЭтапа = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДатаНачала 			= ТекущаяДата();
	СрокСогласования 	= ПолучитьСрокСогласованияТекущегоЭтапа();
	
	//Обновляем объекты формы
	СтрокаТекущегоЭтапа.ДатаНачала 				= ДатаНачала;
	СтрокаТекущегоЭтапа.СостояниеСогласования  	= ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.НаСогласовании");
	СтрокаТекущегоЭтапа.ПлановаяДатаЗавершения  = ДатаНачала + СрокСогласования;
	СтрокаТекущегоЭтапа.ИндексКартинки 			=  1;

	
	Если ЭтапСогласования.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Последовательное") Тогда
		
		//Только для первой строки
		СтрокаМаршрута = МаршрутСогласования[0];
		СтрокаМаршрута.Получено 			= ДатаНачала;
		СтрокаМаршрута.ПлановаяДата 		= ДатаНачала + СтрокаМаршрута.СрокСогласования * 60 * 60;
		СтрокаМаршрута.ОжидаетСогласования 	= Истина;
		
	Иначе
		
		//Обновляем все строки
		Для Каждого СтрокаМаршрута из МаршрутСогласования Цикл
			СтрокаМаршрута.Получено 			= ДатаНачала;
			СтрокаМаршрута.ПлановаяДата 		= ДатаНачала + СтрокаМаршрута.СрокСогласования * 60 * 60;
			СтрокаМаршрута.ОжидаетСогласования 	= Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	ПараметрыЗаписиМаршрута = CW_СогласованиеКлиентСервер.ПолучитьСтруктуруПараметровЗаписиМаршрута();
	ПараметрыЗаписиМаршрута.ЗаписатьРеквизиты 				= Истина;
	ПараметрыЗаписиМаршрута.ЗаписатьМаршрут 				= Истина;
	ПараметрыЗаписиМаршрута.ЗаписатьОбъектНаСогласование 	= Истина;
	ПараметрыЗаписиМаршрута.ЗаписатьСостояниеОбъекта 		= Истина;
	ПараметрыЗаписиМаршрута.ОповеститьПользователей 		= Истина;    
	ПараметрыЗаписиМаршрута.СостояниеОбъекта 				= ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.НаСогласовании");    
	
	ЗаписатьДанныеМаршрутаСогласования(ПараметрыЗаписиМаршрута);
	
	УстановитьДоступностьКнопокСогласования();
		
КонецПроцедуры

&НаСервере
Функция ПолучитьСрокСогласованияТекущегоЭтапа()
	
	ПлановыйСрок = 0;
	Если ЭтапСогласования.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Последовательное") Тогда
		ПлановыйСрок = МаршрутСогласования.Итог("СрокСогласования");
	Иначе
		Для Каждого СтрокаМаршрута из МаршрутСогласования Цикл
			ПлановыйСрок = Макс(СтрокаМаршрута.СрокСогласования, ПлановыйСрок);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПлановыйСрок * 60 * 60;

КонецФункции

&НаСервере
Процедура ПроверитьЗаполениеТаблицыСогласования(Отказ) 
	
	Для Каждого СтрокаМаршрута из МаршрутСогласования Цикл
		
		ИндексСтроки = МаршрутСогласования.Индекс(СтрокаМаршрута);
		Если НЕ ЗначениеЗаполнено(СтрокаМаршрута.ГруппаСогласования) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена Группа согласования",, "МаршрутСогласования["+ИндексСтроки+"].ГруппаСогласования","ЭтаФорма", Отказ);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаМаршрута.Пользователь) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен Пользователь",, "МаршрутСогласования["+ИндексСтроки+"].Пользователь","ЭтаФорма", Отказ);
		КонецЕсли;
		
	КонецЦикла;   
	
КонецПроцедуры


&НаКлиенте
Процедура СогласованиеСоглсовано(Команда)
	
	ТекущаяСтрока = Элементы.МаршрутСогласования.ТекущаяСтрока;
	
	СогласованиеДоступно = ПроверитьВозмоностьСогласования(ТекущаяСтрока);
	
	Если Не СогласованиеДоступно Тогда
		ПоказатьПредупреждение(,"Согласование недоступно!",,"Ошибка"); 
	Иначе
		Режим = РежимДиалогаВопрос.ДаНет;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТекущаяСтрока", ТекущаяСтрока);
		
		Оповещение = Новый ОписаниеОповещения("ПродолжитьСогласование", ЭтотОбъект, СтруктураПараметров);
		ПоказатьВопрос(Оповещение, "Согласовать документ?", Режим, 0);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСогласование(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Новый Структура;
	
	ДанныеСтроки.Вставить("Событие",		ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.Согласовано"));
	ДанныеСтроки.Вставить("ДатаСобытия", 	ТекущаяДата());
	ДанныеСтроки.Вставить("Замечания",  	"");
	
	ОбработатьСтрокуСогласованияНаСервере(ДопПараметры.ТекущаяСтрока, ДанныеСтроки, Истина);
	
	УстановитьДоступностьКнопокСогласования();   
	
	Оповестить("Изменение_СогласованиеОбъектов");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокуСогласованияНаСервере(ИдентифкаторСтроки, ДанныеСогласования, ЗаписатьОбъектНаСогласование=Ложь)
	
	ПараметрыЗавершенияЭтапа = Новый Структура("Заврешить,Состояние,ЗаписатьСостояниеОбъекта,СогласованиеЗавершить", Ложь, Неопределено, Истина, Истина);
	
	ИндексыКартинкиСтрок  = ПолучитьСоответствиеИндексаКартинкиСтрок();
	
	СтрокаТекущая = МаршрутСогласования.НайтиПоИдентификатору(ИдентифкаторСтроки);
	СтрокаТекущая.Пользователь 			= ПараметрыСеанса.ТекущийПользователь;
	СтрокаТекущая.Событие       		= ДанныеСогласования.Событие;
	СтрокаТекущая.ДатаСобытия   		= ДанныеСогласования.ДатаСобытия;
	СтрокаТекущая.Замечания   			= ДанныеСогласования.Замечания;
	СтрокаТекущая.Продолжительность 	= СтрокаТекущая.Получено - СтрокаТекущая.ДатаСобытия;
	СтрокаТекущая.ИндексКартинки    	= ИндексыКартинкиСтрок.Получить(ДанныеСогласования.Событие);
	СтрокаТекущая.ОжидаетСогласования 	= Ложь;
	
	ИндексТекущейСтроки = МаршрутСогласования.Индекс(СтрокаТекущая);
	ЭтоПоследняяСтроока = МаршрутСогласования.Количество() = (ИндексТекущейСтроки + 1);
	
	ОповеститьИнициатора = Ложь;
	Если ЭтапСогласования.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Последовательное") Тогда

		Если ДанныеСогласования.Событие = ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.Согласовано") Тогда
			Если Не ЭтоПоследняяСтроока тогда
				СледующаяСтрока = МаршрутСогласования[ИндексТекущейСтроки+1];
				СледующаяСтрока.Получено 	 		= ТекущаяДата();
				СледующаяСтрока.ПлановаяДата 		= СледующаяСтрока.Получено + СледующаяСтрока.СрокСогласования * 60 * 60;
				СледующаяСтрока.ОжидаетСогласования = Истина;
			КонецЕсли;
		КонецЕсли;
		
		мСтрокиОтклонено = МаршрутСогласования.НайтиСтроки(Новый Структура("Событие",ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.Отклонено")));
		Если мСтрокиОтклонено.Количество() > 0 Тогда
			ОповеститьИнициатора = ЭтапСогласования.Инициатор <> ПараметрыСеанса.ТекущийПользователь;  
			
			ПараметрыЗавершенияЭтапа.Заврешить = Истина;
			ПараметрыЗавершенияЭтапа.Состояние = ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Отклонен");
		Иначе
			мСтрокиПустое = МаршрутСогласования.НайтиСтроки(Новый Структура("Событие",ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.ПустаяСсылка")));
			Если мСтрокиПустое.Количество() = 0 Тогда
				ОповеститьИнициатора = ЭтапСогласования.Инициатор <> ПараметрыСеанса.ТекущийПользователь;
				
				ПараметрыЗавершенияЭтапа.Заврешить = Истина;
				ПараметрыЗавершенияЭтапа.Состояние = ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Согласован");
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		мСтрокиПустое = МаршрутСогласования.НайтиСтроки(Новый Структура("Событие",ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.ПустаяСсылка")));
		Если мСтрокиПустое.Количество() = 0 Тогда
			ОповеститьИнициатора = ЭтапСогласования.Инициатор <> ПараметрыСеанса.ТекущийПользователь;
			
			ПараметрыЗавершенияЭтапа.Заврешить = Истина;
			ПараметрыЗавершенияЭтапа.Состояние = ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Согласован");	
		КонецЕсли;    
		
		мСтрокиОтклонено = МаршрутСогласования.НайтиСтроки(Новый Структура("Событие",ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.Отклонено")));
		Если мСтрокиОтклонено.Количество() > 0 Тогда
			ПараметрыЗавершенияЭтапа.Заврешить = Истина;
			ПараметрыЗавершенияЭтапа.Состояние = ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Отклонен");
		КонецЕсли;
			
		
	КонецЕсли; 
	
	//Автоматическое заврешение
	Если ЭтапСогласования.АвтоматическоеЗавершение и 
		ПараметрыЗавершенияЭтапа.Заврешить = Истина Тогда
		
		ПараметрыЗавершенияЭтапа.Вставить("СостояниеОбъекта", ПараметрыЗавершенияЭтапа.Состояние);
		
		ОбработатьЗавершениеЭтапаСогласованияНаСервере(ПараметрыЗавершенияЭтапа);
	КонецЕсли;
	//Автоматическое заврешение
	
	
	ПараметрыЗаписиМаршрута = CW_СогласованиеКлиентСервер.ПолучитьСтруктуруПараметровЗаписиМаршрута();
	ПараметрыЗаписиМаршрута.ЗаписатьМаршрут 				= Истина;
	ПараметрыЗаписиМаршрута.ЗаписатьОбъектНаСогласование 	= ЗаписатьОбъектНаСогласование;
	ПараметрыЗаписиМаршрута.ОповеститьПользователей 		= ЭтапСогласования.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Последовательное");
	ПараметрыЗаписиМаршрута.ОповеститьИнициатора 			= ОповеститьИнициатора;

	ЗаписатьДанныеМаршрутаСогласования(ПараметрыЗаписиМаршрута);

КонецПроцедуры

&НаКлиенте
Процедура СогласованиеОтклонить(Команда)
	
	ТекущаяСтрока 			= Элементы.МаршрутСогласования.ТекущаяСтрока;
	СогласованиеДоступно 	= ПроверитьВозмоностьСогласования(ТекущаяСтрока);
	
	Если Не СогласованиеДоступно Тогда
		ПоказатьПредупреждение(,"Невозожно отклонить!",,"Ошибка"); 
	Иначе
		Режим = РежимДиалогаВопрос.ДаНет;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТекущаяСтрока", ТекущаяСтрока);
		
		Оповещение = Новый ОписаниеОповещения("ПродолжитьСогласованиеОтклонить", ЭтотОбъект, СтруктураПараметров);
		ПоказатьВопрос(Оповещение, "Отклонить документ?", Режим, 0);
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПродолжитьСогласованиеОтклонить(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗамечанияТекст", "");
	СтруктураПараметров.Вставить("ТолькоПросмотр", Ложь);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", 	Параметры.ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("Событие", 		ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.Отклонено"));
	ДополнительныеПараметры.Вставить("ДатаСобытия",     Неопределено);
	ДополнительныеПараметры.Вставить("ТолькоПросмотр",  Ложь);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтрокиКомментария", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаЗамечанийСогласования", СтруктураПараметров, ЭтаФорма,,,,Оповещение,  РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	

КонецПроцедуры    

&НаКлиенте
Процедура ПослеВводаСтрокиКомментария(ЗамечанияТекст, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗамечанияТекст = Неопределено 
			И НЕ ДополнительныеПараметры.ТолькоПросмотр Тогда
			
		ДатаСобытия = ?(ДополнительныеПараметры.ДатаСобытия = Неопределено, ТекущаяДата(), ДополнительныеПараметры.ДатаСобытия);
		
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("Замечания",	 ЗамечанияТекст);
		ДанныеСтроки.Вставить("Событие",	 ДополнительныеПараметры.Событие);
		ДанныеСтроки.Вставить("ДатаСобытия", ДатаСобытия);
		
		ОбработатьСтрокуСогласованияНаСервере(ДополнительныеПараметры.ТекущаяСтрока, ДанныеСтроки);
		
		УстановитьДоступностьКнопокСогласования();
		
		Оповестить("Изменение_СогласованиеОбъектов");

	КонецЕсли;
	
КонецПроцедуры
	


&НаСервере
Функция ПолучитьСоответствиеИндексаКартинкиСтрок()
	
	Результат = Новый Соответствие;
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.ПустаяСсылка"), 	0);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.Согласовано"), 	1);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.Отклонено"), 		2);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеИндексаКартинкиЭтаповСогласования()
	
	Результат = Новый Соответствие;
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Черновик"), 			0);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.НаСогласовании"), 	1);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Согласован"), 		2);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Отклонен"), 			3);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Прервано"), 			4);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьВозмоностьСогласования(ТекущаяСтрока) Экспорт
	
	СтрокаМаршрута = МаршрутСогласования.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если НЕ СтрокаМаршрута.ОжидаетСогласования Тогда
		Возврат ложь;
	КонецЕсли;
	
	СогласованиеДоступно = ПоверитьДоступностьСогласования(СтрокаМаршрута.ГруппаСогласования);
	Если НЕ СогласованиеДоступно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭтапСогласования.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Параллельное") Тогда
		Возврат Истина;
	КонецЕсли;
	
	//Далее последовательное согласование
	ИндексТекущейСтроки = МаршрутСогласования.Индекс(СтрокаМаршрута);
	Если ИндексТекущейСтроки = 0 Тогда
		Возврат Истина; //Это первый, согласование разрешено
	КонецЕсли;
	
	ПредыдущаяСтрока = МаршрутСогласования[ИндексТекущейСтроки-1];
	Если ПредыдущаяСтрока.Событие <> ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.Согласовано") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


&НаСервереБезКонтекста
Функция ПоверитьДоступностьСогласования(ГруппаСогласования) Экспорт
	
	Возврат Справочники.CW_ГруппыСогласования.ТекущийПользовательВГруппеСогласования(ГруппаСогласования);
	
КонецФункции



&НаСервере
Функция ПроверитьВозможностьВводаКомментарияСогласовнаия(ИдентифкаторСтроки) Экспорт
	
	СтрокаМаршрута = МаршрутСогласования.НайтиПоИдентификатору(ИдентифкаторСтроки);
	
	Если СтрокаМаршрута.Событие = ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.ПустаяСсылка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПользовательМожетРедактироватьКомментарий(ИдентифкаторСтроки)
	
	СтрокаМаршрута 	= МаршрутСогласования.НайтиПоИдентификатору(ИдентифкаторСтроки);
	
	Разрешено = ЭтапСогласования.СостояниеСогласования = ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.НаСогласовании");
	Если Разрешено Тогда
		Разрешено = СтрокаМаршрута.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Возврат Разрешено;
	
КонецФункции


&НаКлиенте
Процедура СогласованиеКомментарий(Команда)
	
	ТекущаяСтрока 			= Элементы.МаршрутСогласования.ТекущаяСтрока;
	
	ВводКомментарияДоступен = ПроверитьВозможностьВводаКомментарияСогласовнаия(ТекущаяСтрока);
	Если Не ВводКомментарияДоступен Тогда
		ПоказатьПредупреждение(,"Невозможно ввести замечания!",30, "Ошибка ввода замечаний");
		Возврат;
	Иначе
		
		ТекущиеДанные	= Элементы.МаршрутСогласования.ТекущиеДанные;
		ЗамечанияТекст 	= ТекущиеДанные.Замечания;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЗамечанияТекст", ЗамечанияТекст);

		РедактированиеКомментарияРазрешено = ПользовательМожетРедактироватьКомментарий(ТекущаяСтрока);
		СтруктураПараметров.Вставить("ТолькоПросмотр", Не РедактированиеКомментарияРазрешено);
	
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущаяСтрока", 	ТекущаяСтрока);
		ДополнительныеПараметры.Вставить("Событие", 		ТекущиеДанные.Событие);
		ДополнительныеПараметры.Вставить("ДатаСобытия",     ТекущиеДанные.ДатаСобытия);
		ДополнительныеПараметры.Вставить("ТолькоПросмотр",  Не РедактированиеКомментарияРазрешено);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВводаСтрокиКомментария", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.CW_ФормаЗамечанийСогласования", СтруктураПараметров, ЭтаФорма,,,,Оповещение,  РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СогласованиеЗавершить(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	
	ПараметрыОтмены = Новый Структура;
	ПараметрыОтмены.Вставить("Состояние", Неопределено);
	ПараметрыОтмены.Вставить("ЗаписатьСостояниеОбъекта", Истина);
	ПараметрыОтмены.Вставить("СогласованиеЗавершить", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьЗавершениеЭтапаСогласования", ЭтотОбъект, ПараметрыОтмены);
	ПоказатьВопрос(Оповещение, "Завершить процедуру согласования?", Режим, 0);	

КонецПроцедуры

&НаКлиенте
Процедура СогласованиеОтмена(Команда) 
	
	Режим = РежимДиалогаВопрос.ДаНет;
	
	ПараметрыОтмены = Новый Структура;
	ПараметрыОтмены.Вставить("Состояние", ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Прервано"));
	ПараметрыОтмены.Вставить("ЗаписатьСостояниеОбъекта", Ложь);
	ПараметрыОтмены.Вставить("СогласованиеЗавершить", 	Ложь);
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьЗавершениеЭтапаСогласования", ЭтотОбъект, ПараметрыОтмены);
	ПоказатьВопрос(Оповещение, "Прервать процедуру согласования?", Режим, 0);	
	
КонецПроцедуры
	

&НаСервере
Функция ПолучитьСписокСостоянийНаСервере()
	
	СписокЗначений = Новый СписокЗначений;
	
	Для Каждого ЗначениеПеречисления из	Метаданные.Перечисления.CW_СостоянияСогласования.ЗначенияПеречисления Цикл
		СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования."+СокрЛП(ЗначениеПеречисления.Имя)));	
	КонецЦикла;   
	
	Возврат СписокЗначений;

КонецФункции

&НаКлиенте
Процедура ОбработатьЗавершениеЭтапаСогласования(Результат, ПараметрыОтмены) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;   
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборНовогоСтатуса", ЭтотОбъект, ПараметрыОтмены);
	Если ПараметрыОтмены.СогласованиеЗавершить Тогда  
		РезультатВыбора = Новый Структура;
		РезультатВыбора.Вставить("Значение", ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.ПустаяСсылка"));
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Неопределено);
	Иначе
		СписокСостояний = ПолучитьСписокСостоянийНаСервере();
		СписокСостояний.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите статус документа");  
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработатьВыборНовогоСтатуса(РезультатВыбора, ПараметрыОтмены) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		ПараметрыОтмены.Вставить("ЗаписатьСостояниеОбъекта", 	Истина);
		ПараметрыОтмены.Вставить("СостояниеОбъекта", 			РезультатВыбора.Значение);
	КонецЕсли;
	
	ОбработатьЗавершениеЭтапаСогласованияНаСервере(ПараметрыОтмены);

	Оповестить("Изменение_СогласованиеОбъектов");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗавершениеЭтапаСогласованияНаСервере(ПараметрыОтмены)
	
	СтрокаТекущегоЭтапа = ПолучитьСтрокуТекущегоЭтапаСогласования();
	Если СтрокаТекущегоЭтапа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеИндексаКартинки = ПолучитьСоответствиеИндексаКартинкиЭтаповСогласования();
	
	Если ПараметрыОтмены.Состояние = Неопределено Тогда
		СостояниеСогласования = ПолучитьСостояниеЭтапаСогласования();
	Иначе
		СостояниеСогласования = ПараметрыОтмены.Состояние;
	КонецЕсли;  
	
	СтрокаТекущегоЭтапа.Завершен 				= Истина;
	СтрокаТекущегоЭтапа.СостояниеСогласования 	= СостояниеСогласования; 
	СтрокаТекущегоЭтапа.ИндексКартинки 			= СоответствиеИндексаКартинки.Получить(СтрокаТекущегоЭтапа.СостояниеСогласования);
	СтрокаТекущегоЭтапа.ДатаЗавершения 			= ТекущаяДата();
	
	ПараметрыЗаписиМаршрута = CW_СогласованиеКлиентСервер.ПолучитьСтруктуруПараметровЗаписиМаршрута();
	ПараметрыЗаписиМаршрута.ЗаписатьРеквизиты 				= Истина;
	ПараметрыЗаписиМаршрута.ОтменитьОбъектНаСогласование 	= Истина;
	ПараметрыЗаписиМаршрута.ЗаписатьСостояниеОбъекта 		= ПараметрыОтмены.ЗаписатьСостояниеОбъекта;
	
	Если ПараметрыОтмены.Свойство("СостояниеОбъекта") Тогда
		ПараметрыЗаписиМаршрута.СостояниеОбъекта = ПараметрыОтмены.СостояниеОбъекта;	
	КонецЕсли;
	
	ЗаписатьДанныеМаршрутаСогласования(ПараметрыЗаписиМаршрута);
	
	УстановитьДоступностьКнопокСогласования();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСостояниеЭтапаСогласования()
	
	мСтрокиОтклонено = МаршрутСогласования.НайтиСтроки(Новый Структура("Событие",ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.Отклонено")));
	Если мСтрокиОтклонено.Количество() > 0 Тогда
		Возврат ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Отклонен");
	КонецЕсли;
	
	мСтрокиПустое = МаршрутСогласования.НайтиСтроки(Новый Структура("Событие",ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.ПустаяСсылка")));
	Если мСтрокиПустое.Количество() = 0 Тогда
		Возврат ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Согласован");
	КонецЕсли;
	
	Возврат ЭтапСогласования.СостояниеСогласования;
	
КонецФункции

&НаКлиенте
Процедура МаршрутСогласованияГруппаСогласованияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.МаршрутСогласования.ТекущаяСтрока;
	ГруппаСогласованияПриИзмененииНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ГруппаСогласованияПриИзмененииНаСервере(ИдентификаторСтроки)
	
	СтрокаТекущая = МаршрутСогласования.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрокаТекущая.Пользователь = ПолучитьПользователяГруппыСогласования(СтрокаТекущая.ГруппаСогласования);
	
	ПараметрыЗаписиМаршрута = CW_СогласованиеКлиентСервер.ПолучитьСтруктуруПараметровЗаписиМаршрута();
	ПараметрыЗаписиМаршрута.ЗаписатьРеквизиты 	= Ложь;
	ПараметрыЗаписиМаршрута.ЗаписатьМаршрут 	= Истина;
	
	ЗаписатьДанныеМаршрутаСогласования(ПараметрыЗаписиМаршрута);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПользователяГруппыСогласования(ГруппаСогласования)

	Если ГруппаСогласования.СписокСотрудников.Количество() > 0 Тогда
		СтрокаСписка = ГруппаСогласования.СписокСотрудников[0];
	    Возврат СтрокаСписка.Пользователь;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
КонецФункции


&НаКлиенте
Процедура МаршрутСогласованияПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока 	= Элементы.МаршрутСогласования.ТекущаяСтрока;
	ДанныеВыбора 	= ПолучитьСписокПользователейГруппыСогласовнаия(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура МаршрутСогласованияПользовательАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока 	= Элементы.МаршрутСогласования.ТекущаяСтрока;
	ДанныеВыбора 	= ПолучитьСписокПользователейГруппыСогласовнаия(ТекущаяСтрока);

КонецПроцедуры


&НаСервере
Функция ПолучитьСписокПользователейГруппыСогласовнаия(ИдентификаторСтроки)
	
	ТекущаяСтрока 		= МаршрутСогласования.НайтиПоИдентификатору(ИдентификаторСтроки);
	МассивПользователй 	= Справочники.CW_ГруппыСогласования.ПолучитьСписокПользователейГруппыСогласования(ТекущаяСтрока.ГруппаСогласования);
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(МассивПользователй);
	
	Возврат СписокЗначений;
	
КонецФункции


&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьЭтапыСогласования();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуТекущегоЭтапаСогласования()
	
	мСтроки = ЭтапыСогласования.НайтиСтроки(Новый Структура("ЭтапСогласования",ЭтапСогласования));
	Если мСтроки.Количество() = 0 Тогда
		//нет строки текущего этапа, это ошибка
		Возврат Неопределено;
	КонецЕсли;

	//Должна быть только одна строка
	Возврат мСтроки[0];
	
КонецФункции

&НаКлиенте
Процедура МаршрутСогласованияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НоваяСтрока Тогда
		УстановитьДоступностьКнопокСогласования();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЛистаСогласования(Команда)
	
	ПараметрКоманды = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектСогласования);
	
	Ответ = CW_Печать.ПолучитьПараметрыФормыПечати(ПараметрКоманды, ЭтаФорма.УникальныйИдентификатор);
	
	Если _УФКС.ВыполненоУспешно(Ответ) Тогда
		ОткрытьФорму("ОбщаяФорма.CW_Печать",Ответ.ПФ,ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗавершатьАвтоматически(Команда)  
	
	ЗавершатьАвтоматическиНаСервере(); 
	
КонецПроцедуры   

&НаСервере
Процедура ЗавершатьАвтоматическиНаСервере()
	
	СтрокаТекущегоЭтапа = ПолучитьСтрокуТекущегоЭтапаСогласования();
	Если СтрокаТекущегоЭтапа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Запишем в строку
	СтрокаТекущегоЭтапа.АвтоматическоеЗавершение = НЕ СтрокаТекущегоЭтапа.АвтоматическоеЗавершение;
	
	ПараметрыЗаписиМаршрута = CW_СогласованиеКлиентСервер.ПолучитьСтруктуруПараметровЗаписиМаршрута();
	ПараметрыЗаписиМаршрута.ЗаписатьРеквизиты = Истина;

	ЗаписатьДанныеМаршрутаСогласования(ПараметрыЗаписиМаршрута);
	
	УстановитьПометкуКнопокЭтапаСогласования(ЭтапСогласования);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыСогласованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	ТекущиеДанные = Элементы.ЭтапыСогласования.ТекущиеДанные;
	ИзменитьНаименованиеНаКлиенте(ТекущиеДанные);  
	
КонецПроцедуры
